{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "MistralForSequenceClassification",
    "parent_library": "transformers.models.mistral.modeling_mistral"
  },
  "base_model_name_or_path": "/data/huggingface/transformers/mistralai/Mistral-7B-v0.1",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": null
}